accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/usage/GetPrepaidBundlesBalance-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetPrepaidBundleBalances">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetPrepaidBundleBalancesResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:MsisDn>?</get:MsisDn>
               <!--Optional:-->
               <get:AccountNumber>?</get:AccountNumber>
               <!--Optional:-->
               <get:Product>?</get:Product>
               <!--Optional:-->
               <get:ServiceProvider>?</get:ServiceProvider>
               <!--Optional:-->
               <get:Status>?</get:Status>
               <!--Optional:-->
               <get:CreationDate>?</get:CreationDate>
               <!--Optional:-->
               <get:WalletExpiryDate>?</get:WalletExpiryDate>
               <!--Optional:-->
               <get:BalanceExpiryDate>?</get:BalanceExpiryDate>
               <!--Optional:-->
               <get:Balance>?</get:Balance>
               <!--Optional:-->
               <get:InitialBalance>?</get:InitialBalance>
               <!--Optional:-->
               <get:Language>?</get:Language>
               <!--Optional:-->
               <get:Balances>
                  <!--Zero or more repetitions:-->
                  <get:BalanceItem>
                     <!--Optional:-->
                     <get:BalanceName>?</get:BalanceName>
                     <!--Zero or more repetitions:-->
                     <get:Bucket>
                        <!--Optional:-->
                        <get:BucketValue>?</get:BucketValue>
                        <!--Optional:-->
                        <get:BucketExpiry>?</get:BucketExpiry>
                     </get:Bucket>
                  </get:BalanceItem>
               </get:Balances>
               <!--Optional:-->
               <get:LastRechargeDate>?</get:LastRechargeDate>
               <!--Optional:-->
               <get:LastCCRechargeDate>?</get:LastCCRechargeDate>
               <!--Optional:-->
               <get:LastUseDate>?</get:LastUseDate>
               <!--Optional:-->
               <get:LastRechargeAmount>?</get:LastRechargeAmount>
               <!--Optional:-->
               <get:PrevWalletExpiryDate>?</get:PrevWalletExpiryDate>
               <!--Optional:-->
               <get:PrevBalanceExpiryDate>?</get:PrevBalanceExpiryDate>
               <!--Optional:-->
               <get:PrevBalance>?</get:PrevBalance>
               <!--Optional:-->
               <get:LastExpCredit>?</get:LastExpCredit>
               <!--Optional:-->
               <get:TotalExpCredit>?</get:TotalExpCredit>
               <!--Optional:-->
               <get:LastExpDate>?</get:LastExpDate>
               <!--Optional:-->
               <get:FirstActivationDate>?</get:FirstActivationDate>
               <!--Optional:-->
               <get:LastStateChangeDate>?</get:LastStateChangeDate>
               <!--Optional:-->
               <get:LastStateChangeReason>?</get:LastStateChangeReason>
               <!--Optional:-->
               <get:BypassNumber>?</get:BypassNumber>
               <!--Optional:-->
               <get:WalletType>?</get:WalletType>
               <!--Optional:-->
               <get:CharginDomain>?</get:CharginDomain>
               <!--Optional:-->
               <get:FFD>?</get:FFD>
               <!--Optional:-->
               <get:FFN>
                  <!--Zero or more repetitions:-->
                  <get:Number>?</get:Number>
               </get:FFN>
               <!--Optional:-->
               <get:FDN>?</get:FDN>
               <!--Optional:-->
               <get:CUG>
                  <!--Zero or more repetitions:-->
                  <get:Name>?</get:Name>
               </get:CUG>
               <!--Optional:-->
               <get:Currency>?</get:Currency>
               <!--Optional:-->
               <get:WalletID>?</get:WalletID>
               <!--Optional:-->
               <get:LastRpSwap>?</get:LastRpSwap>
               <!--Optional:-->
               <get:ActivationDate>?</get:ActivationDate>
            </lcew:Body>
         </Response>
      </web:GetPrepaidBundleBalancesResponse>
   </soapenv:Body>
</soapenv:Envelope>